In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
gdp_df = pd.read_csv("../data/gdp_per_capita.csv")

In [3]:
gdp_df.head(10)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN
6     Afghanistan  2013  2116.465454              NaN
7     Afghanistan  2012  2075.491747              NaN
8     Afghanistan  2011  1904.559799              NaN
9     Afghanistan  2010  1957.029338              NaN

In [4]:
gdp_df.tail(5)

,Country or Area,Year,Value,Value Footnotes
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [5]:
gdp_df = gdp_df.drop(gdp_df.index[[6868, 6869]])

In [6]:
gdp_df= gdp_df.drop(columns="Value Footnotes")

In [7]:
gdp_df = gdp_df.rename(columns = {'Country or Area': 'Country', 'Year': 'Year', 'Vaule': 'GDP_Per_Capita'})

In [8]:
gdp_df.shape

(6868, 3)

In [9]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6868 entries, 0 to 6867
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  6868 non-null   object
 1   Year     6868 non-null   object
 2   Value    6868 non-null   float64
dtypes: float64(1), object(2)
memory usage: 214.6+ KB

In [10]:
gdp_df['Year']= gdp_df['Year'].astype('int')

In [11]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6868 entries, 0 to 6867
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  6868 non-null   object
 1   Year     6868 non-null   int32
 2   Value    6868 non-null   float64
dtypes: float64(1), int32(1), object(1)
memory usage: 187.8+ KB

In [15]:
gdp_df[['Year']]

      Year
0     2019
1     2018
2     2017
3     2016
4     2015
...    ...
6863  1994
6864  1993
6865  1992
6866  1991
6867  1990

[6868 rows x 1 columns]